In [1]:
import numpy as np
import pandas as pd

In [2]:
dict1={
    "name":['shweta','sel','chi','sweat'],
    "marks":[99,96,93,92],
    "city":["LA","TOKYO","SEOUL",'BANGALORE']
}

In [3]:
df=pd.DataFrame(dict1)

In [4]:
df

     name  marks       city
0  shweta     99         LA
1     sel     96      TOKYO
2     chi     93      SEOUL
3   sweat     92  BANGALORE

In [5]:
df.to_csv("name_list.csv")

In [6]:
df.to_csv("name_list_index_false.csv", index=False)

In [7]:
df.head(2)

     name  marks   city
0  shweta     99     LA
1     sel     96  TOKYO

In [9]:
df.tail(1)

    name  marks       city
3  sweat     92  BANGALORE

In [10]:
df.describe()

           marks
count   4.000000
mean   95.000000
std     3.162278
min    92.000000
25%    92.750000
50%    94.500000
75%    96.750000
max    99.000000

In [14]:
shweta=pd.read_csv('train.csv')

In [15]:
shweta

   tarin no  speed       city
0       122     99         LA
1      4423     30      TOKYO
2        78     60      SEOUL
3      4554    200  BANGALORE

In [16]:
shweta['speed']

0     99
1     30
2     60
3    200
Name: speed, dtype: int64

In [17]:
shweta['speed'][0]=600

C:\Users\KIIT\AppData\Local\Temp\ipykernel_26548\2121496386.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  shweta['speed'][0]=600

In [18]:
shweta

   tarin no  speed       city
0       122    600         LA
1      4423     30      TOKYO
2        78     60      SEOUL
3      4554    200  BANGALORE

In [19]:
shweta.to_csv('train_new.csv')

In [20]:
shweta.index=[1,2,'third','fouth duh']

In [21]:
shweta

           tarin no  speed       city
1               122    600         LA
2              4423     30      TOKYO
third            78     60      SEOUL
fouth duh      4554    200  BANGALORE

In [23]:
#series->1-d array with indices, 1 row/1 column holding any type of data
#dataframe-> spreadsheet 2-d array with columns of potentially different types of data
#numpy->speed